Repository: loloof64/ChessGifGenerator
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# pages_new_gif_title
source: New gif
es: Nuevo GIF
fr: Nouveau GIF

# pages_new_gif_buttons_manual_creation
source: Manual edition
es: Edición manual
fr: Édition manuelle

# pages_new_gif_buttons_creation_from_pgn
source: From PGN file
es: Desde archivo PGN
fr: A partir fichier PGN

# pages_new_gif_failed_loading_pgn
source: Failed to load the PGN file.
es: No se pudo cargar el archivo PGN.
fr: Erreur de chargement du PGN.

# pages_gif_edition_title
source: GIF creation
es: Creación de GIF
fr: Création de GIF

# pages_gif_edition_generate_button
source: Generate
es: Generar
fr: Générer

# pages_gif_edition_failed_generating_gif_error
source: Failed to generate GIF.
es: No se pudo generar el GIF.
fr: Echec de génération du GIF.

# pages_gif_edition_success_generating_gif
source: GIF generated.
es: GIF generado.
fr: GIF généré.

# pages_gif_edition_select_save_file
source: Select the save file
es: Seleccione el archivo de guardado
fr: Choisissez le fichier de sauvegarde

# pages_gif_edition_include_arrows
source: Arrows
es: Flechas
fr: Flèches

# pages_gif_edition_include_coordinates
source: Coordinates
es: Coordenadas
fr: Coordonnées

# pages_gif_edition_framerate
source: Images duration (ms)
es: Duración imágenes (ms)
fr: Durée images (ms)

# pages_gif_edition_error_taking_screenshot
source: Error saving board into image.
es: Error al guardar el tablero en la imagen.
fr: Erreur de sauvegarde de l'échiquier en image.

# pages_gif_edition_target_size
source: Size (px)
es: Talla (px)
fr: Taille (px)

# pages_gif_edition_no_option_while_generating
source: No option available while generating image !
es: ¡No hay opción disponible al generar la imagen!
fr: Aucune option disponible pendant la génération d'image !

# pages_gif_edition_options_drawer_title
source: Options
es: Opciones

# game_selector_title
source: Select the game
es: Selecciona el juego
fr: Sélectionnez la partie

source: No move in selected game.
es: Sin movimiento en el juego seleccionado.
fr: Aucun coup dans la partie sélectionnée.

# buttons_cancel
source: Cancel
es: Anular
fr: Annuler

# buttons_ok
source: Ok
es: De acuerdo
fr: D'accord

# buttons_update
source: Update
es: Actualizar
fr: MAJ

# buttons_go_back
source: Back
es: Volver
fr: Revenir
